app/views/folders/index.html.erb

SELECT "links".* FROM "links" WHERE "links"."folder_id" = 3
SELECT COUNT(*) FROM "links" WHERE "links"."folder_id" = 1
---
<% @folders.each do |folder| %>
<% if !folder.links.empty? %>

SELECT "tags".* FROM "tags" WHERE (lower(name) = 'events' OR lower(name) = 'sports')
---
                <span class="link_label">Link:</span> <%= link_to link.link_url, link.link_url %><br>
              <% if !link.tags.empty? %>