app/views/folders/show.html.erb

  <% @folder.links.reverse! %>
  <% @folder.links.each do |link| %>
---
SELECT "links".* FROM "links" WHERE "links"."folder_id" = 8