app/views/links/_form.html.erb

    <%= f.label :folder_id %>
    <%= f.select :folder_id, Folder.where(soft_deleted: false).map { |folder| [folder.name, folder.id]}, :include_blank => true, :prompt => "Pick Folder" %>
---
SELECT "folders".* FROM "folders" WHERE "folders"."soft_deleted" = 'f'