app/views/links/index.html.erb

SELECT "tags".* FROM "tags" WHERE (lower(name) = 'blogs' OR lower(name) = 'tutorial')
---
  <% @links.each do |link| %>
  <% class_tags = link.tags.map { |t| t[:name].split(" ") }.flatten %>

INSERT INTO "links" ("created_at", "date", "folder_id", "from", "link_url", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
</ul>
<%= link_to "<< Back", :back %>