app/views/links/show.html.erb

SELECT "tags".* FROM "tags" WHERE (lower(name) = 'ruby' OR lower(name) = 'rails' OR lower(name) = 'tutorial')
---
    <span class="link_label">Link:</span> <%= link_to @link.link_url, @link.link_url %><br>
    <% if !@link.tags.empty? %>

INSERT INTO "links" ("created_at", "date", "folder_id", "from", "link_url", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
</div>
<%= link_to "<< Back", :back %>