app/controllers/folders_controller.rb

SELECT "folders".* FROM "folders" WHERE "folders"."soft_deleted" = 'f'
INSERT INTO "folders" ("created_at", "description", "name", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 15:42:50 UTC +00:00], ["description", "new folder"], ["name", "awesome"], ["soft_deleted", false], ["updated_at", Sat, 20 Jul 2013 15:42:50 UTC +00:00]]
SELECT "links".* FROM "links" WHERE "links"."soft_deleted" = 'f'
INSERT INTO "links" ("created_at", "date", "folder_id", "from", "link_url", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def index
    @folders = Folder.where(soft_deleted: false).sort! { |a, b| a.name <=> b.name }
    Folder.create_folders!

    @links = Link.where soft_deleted: false
    Link.create_links!

INSERT INTO "folders" ("created_at", "description", "name", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 15:43:55 UTC +00:00], ["description", ""], ["name", "newfolder"], ["soft_deleted", false], ["updated_at", Sat, 20 Jul 2013 15:43:55 UTC +00:00]]
---
  def create #creates folder manually vs create method in Folder class which pulls hashtag name
    @folder = Folder.new(params[:folder])
    if @folder.save

SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "links".* FROM "links" WHERE "links"."folder_id" = 8
---
  def show
    @folder = Folder.find(params[:id])
    @links = Link.where soft_deleted: false
    @split_tag_array = []
    @folder.links.map(&:tags).flatten.uniq.each do |full_tag|

SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @folder = Folder.find(params[:id])

SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "folders" SET "description" = 'Mainly Packer links from Karl', "updated_at" = '2013-07-20 20:03:13.274818' WHERE "folders"."id" = 1
---
  def update
    @folder = Folder.find(params[:id])
    updated_folder = @folder.update_attributes(params[:folder])

SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "folders" SET "soft_deleted" = 't', "updated_at" = '2013-07-20 15:43:21.432365' WHERE "folders"."id" = 8
SELECT "links".* FROM "links" WHERE "links"."folder_id" = 8
UPDATE "links" SET "soft_deleted" = 't', "updated_at" = '2013-07-20 15:43:21.438779' WHERE "links"."id" = 26
---
  def destroy
    @folder = Folder.find(params[:id])
    @folder.update_attribute(:soft_deleted, true )
    @folder.links.each do |link|
      link.update_attribute(:soft_deleted, true)