app/controllers/links_controller.rb

  def index
    Folder.create_folders!
    Link.create_links!
    @links = Link.where soft_deleted: false
    @split_tag_array = []
    @links.map(&:tags).flatten.uniq.each do |full_tag|
      full_tag[:name].split(" ").each do |split_tag|
        @split_tag_array << split_tag
---
INSERT INTO "folders" ("created_at", "description", "name", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 29 Jul 2013 03:36:38 UTC +00:00], ["description", "new folder"], ["name", "sanfrancisco"], ["soft_deleted", false], ["updated_at", Mon, 29 Jul 2013 03:36:38 UTC +00:00]]
INSERT INTO "links" ("created_at", "date", "folder_id", "from", "link_url", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "links".* FROM "links" WHERE "links"."soft_deleted" = 'f'
SELECT "links".* FROM "links"
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'funny' OR lower(name) = 'pop_culture' OR lower(name) = 'blogs')
INSERT INTO "tags" ("name") VALUES (?)  [["name", "funny"]]

  def create
    @link = Link.new(params[:link])
    if @link.save
---
INSERT INTO "links" ("created_at", "date", "folder_id", "from", "link_url", "soft_deleted", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "27"]]

  def update
    @link = Link.find(params[:id])
    @updated_link = @link.update_attributes(params[:link])
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "links" SET "folder_id" = NULL, "updated_at" = '2013-07-29 03:52:38.449543' WHERE "links"."id" = 1

  def destroy
    link = Link.find(params[:id])
    link.update_attribute(:soft_deleted, true)
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "27"]]
UPDATE "links" SET "soft_deleted" = 't', "updated_at" = '2013-07-20 15:44:42.112659' WHERE "links"."id" = 27